README.org
* About

Repository of the phase data.

This repository contains the data and experiments of the project.

* Prerequisites

- To flash the firmware we used on our target devices during our attacks, the [[https://github.com/pierreay/phase_fw.git][phase_fw]] repository holds the source code.
- To record I/Q signals from the target device emanations using a software-defined radio (SDR), our SoapySDR receiver utility [[https://github.com/pierreay/soapyrx.git][SoapyRX]] must be installed.
- To process and analyze the datasets composed of I/Q signals, our side-channel experimental toolbox [[https://github.com/pierreay/scaff.git][SCAFF]] must be installed.

* Files

- [[file:expe]] :: Experiments of the project.
- [[file:sets]] :: Datasets built during the project.
- [[file:src]] :: Scripts to work with the repository.

