README.md

# Table of Contents

1.  [About](#orgdd303dd)
2.  [Prerequisites](#org0781f88)
3.  [Files](#org0c32b38)


<a id="orgdd303dd"></a>

# About

Repository of the phase data.

This repository contains the data and experiments of the project.


<a id="org0781f88"></a>

# Prerequisites

-   To flash the firmware we used on our target devices during our attacks, the [phase<sub>fw</sub>](https://github.com/pierreay/phase_fw.git) repository holds the source code.
-   To record I/Q signals from the target device emanations using a software-defined radio (SDR), our SoapySDR receiver utility [SoapyRX](https://github.com/pierreay/soapyrx.git) must be installed.
-   To process and analyze the datasets composed of I/Q signals, our side-channel experimental toolbox [SCAFF](https://github.com/pierreay/scaff.git) must be installed.


<a id="org0c32b38"></a>

# Files

-   **<expe>:** Experiments of the project.
-   **<sets>:** Datasets built during the project.
-   **<src>:** Scripts to work with the repository.

